# Pandas Practice

In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = np.arange(100, 105)
arr

array([100, 101, 102, 103, 104])

In [3]:
s = pd.Series(arr)
s

0    100
1    101
2    102
3    103
4    104
dtype: int32

In [4]:
s = pd.Series(arr, dtype='int64')
s

0    100
1    101
2    102
3    103
4    104
dtype: int64

In [5]:
s = pd.Series(['부장', '차장', '대리', '사원', '인턴'])
s

0    부장
1    차장
2    대리
3    사원
4    인턴
dtype: object

In [6]:
f = ['apple', np.nan, 'banana', 'kiwi', 'gubong']
s2 = pd.Series(f, index = list('가나다라마'))
s2

가     apple
나       NaN
다    banana
라      kiwi
마    gubong
dtype: object

In [7]:
s = pd.Series(['손흥민', '김연아', '박세리', '박찬호', '김연경'], index = ['a', 'b', 'c', 'd', 'e'])
s

a    손흥민
b    김연아
c    박세리
d    박찬호
e    김연경
dtype: object

In [8]:
s[['a', 'c']]

a    손흥민
c    박세리
dtype: object

In [9]:
s.isnull()

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [10]:
s.isna()

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [11]:
data = {
    'name': ['Kim', 'Lee', 'Park'], 
    'age': [24, 27, 34], 
    'children': [2, 1, 3]
}

df = pd.DataFrame(data)
df

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [12]:
df[['name', 'children']]

   name  children
0   Kim         2
1   Lee         1
2  Park         3

In [13]:
df.rename(columns = {'name':'이름'})

     이름  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [14]:
df.rename(columns = {'children':'자녀 수'}, inplace=True)
df

   name  age  자녀 수
0   Kim   24     2
1   Lee   27     1
2  Park   34     3

In [15]:
food_dict = {
    'food': ['KFC', 'McDonald', 'SchoolFood'], 
    'price': [1000, 2000, 2500], 
    'rating': [4.5, 3.9, 4.2]
}
df = pd.DataFrame(food_dict)
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [16]:
df[['food', 'rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [17]:
df.rename(columns= {'food':'place'}, inplace=True)

In [18]:
df

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [19]:
import seaborn as sns

In [20]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [21]:
df['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [22]:
df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [23]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [24]:
df['pclass'].astype('int32').head()

0    3
1    1
2    3
3    1
4    3
Name: pclass, dtype: int32